app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is my first article!"], ["created_at", "2014-11-20 07:07:14.005465"], ["title", "first"], ["updated_at", "2014-11-20 07:07:14.005465"]]

  def show
    @article = Article.find(params[:id])#id from form to sql table
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]